chp4/4_optimising_web/3_perf_testing/result/webcomposite-test.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.webcomposite.com (be patient).....done


Server Software:        Apache
Server Hostname:        www.webcomposite.com
Server Port:            80

Document Path:          /index.html
Document Length:        5271 bytes

Concurrency Level:      4
Time taken for tests:   0.887 seconds
Complete requests:      10
Failed requests:        0
Write errors:           0
Total transferred:      55150 bytes
HTML transferred:       52710 bytes
Requests per second:    11.28 [#/sec] (mean)
Time per request:       354.627 [ms] (mean)
Time per request:       88.657 [ms] (mean, across all concurrent requests)
Transfer rate:          60.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      138  143   3.7    143     149
Processing:   146  154   4.9    157     160
Waiting:      141  149   4.9    150     155
Total:        285  297   7.6    299     307

Percentage of the requests served within a certain time (ms)
  50%    299
  66%    301
  75%    304
  80%    305
  90%    307
  95%    307
  98%    307
  99%    307
 100%    307 (longest request)